InformationRegisters/ТекстовыеСообщенияДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТекстовыеСообщенияДокументовЭДО</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекстовыеСообщенияДокументовЭДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа
//
// Параметры:
//  Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(ЭлектронныйДокумент)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(ЭлектронныйДокумент)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  СообщениеЭДО - ДокументСсылка.СообщениеЭДО
//  ТекстСообщения - Строка
Процедура ДобавитьСообщение(СообщениеЭДО, ТекстСообщения) Экспорт
	Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСообщения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СообщениеЭДО, "ЭлектронныйДокумент, Дата, Направление");
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыСообщения.ЭлектронныйДокумент, "Организация, Контрагент");
	
	ЭлектронныйДокумент = РеквизитыСообщения.ЭлектронныйДокумент;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(РеквизитыСообщения.Дата);
	Набор.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
	Набор.Отбор.Сообщение.Установить(СообщениеЭДО);

	Запись = Набор.Добавить();
	Запись.Период = РеквизитыСообщения.Дата;
	Запись.ЭлектронныйДокумент = ЭлектронныйДокумент;
	Запись.Сообщение = СообщениеЭДО;
	Запись.ТекстСообщения = ТекстСообщения;
	Если РеквизитыСообщения.Направление = Перечисления.НаправленияЭДО.Входящий Тогда
		Запись.Отправитель = РеквизитыДокумента.Контрагент;
		Запись.Получатель = РеквизитыДокумента.Организация;
	Иначе
		Запись.Отправитель = РеквизитыДокумента.Организация;
		Запись.Получатель = РеквизитыДокумента.Контрагент;
		Запись.Прочитано = Истина;
	КонецЕсли;
	
	Набор.Записать();
КонецПроцедуры

// Параметры:
// * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,
// 						 - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Выборка сообщений:
// * Дата - Дата
// * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,
// 							- ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// * Сообщение - ДокументСсылка.СообщениеЭДО
// * ТекстСообщения - Строка
// * Отправитель - ОпределяемыйТип.УчастникЭДО
// * Получатель - ОпределяемыйТип.УчастникЭДО
// * Направление - ПеречислениеСсылка.НаправленияЭДО
// * ПредставлениеОтправитель - Строка
// * ПредставлениеПолучатель - Строка
Функция СписокСообщений(ЭлектронныйДокумент) Экспорт
	
	МетаданныеРегистраСообщений = Метаданные.РегистрыСведений.ТекстовыеСообщенияДокументовЭДО;
	РеквизитыРегистраСообщений = МетаданныеРегистраСообщений.Реквизиты;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Результат.Колонки.Добавить("ЭлектронныйДокумент", МетаданныеРегистраСообщений.Измерения.ЭлектронныйДокумент.Тип);
	Результат.Колонки.Добавить("Сообщение", Новый ОписаниеТипов("ДокументСсылка.СообщениеЭДО"));
	Результат.Колонки.Добавить("ТекстСообщения", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Результат.Колонки.Добавить("Отправитель", РеквизитыРегистраСообщений.Отправитель.Тип);
	Результат.Колонки.Добавить("Получатель", РеквизитыРегистраСообщений.Получатель.Тип);
	Результат.Колонки.Добавить("Направление", Новый ОписаниеТипов("ПеречислениеСсылка.НаправленияЭДО"));
	Результат.Колонки.Добавить("ПредставлениеОтправитель", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Результат.Колонки.Добавить("ПредставлениеПолучатель", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекстовыеСообщенияДокументовЭДО.Период КАК Дата,
		|	ТекстовыеСообщенияДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	ТекстовыеСообщенияДокументовЭДО.Сообщение КАК Сообщение,
		|	ТекстовыеСообщенияДокументовЭДО.ТекстСообщения КАК ТекстСообщения,
		|	ТекстовыеСообщенияДокументовЭДО.Отправитель КАК Отправитель,
		|	ТекстовыеСообщенияДокументовЭДО.Получатель КАК Получатель,
		|	ТекстовыеСообщенияДокументовЭДО.Сообщение.Направление КАК Направление,
		|	ПРЕДСТАВЛЕНИЕ(ТекстовыеСообщенияДокументовЭДО.Отправитель) КАК ПредставлениеОтправитель,
		|	ПРЕДСТАВЛЕНИЕ(ТекстовыеСообщенияДокументовЭДО.Получатель) КАК ПредставлениеПолучатель
		|ИЗ
		|	РегистрСведений.ТекстовыеСообщенияДокументовЭДО КАК ТекстовыеСообщенияДокументовЭДО
		|ГДЕ
		|	ТекстовыеСообщенияДокументовЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаРезультата = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезультата, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
// СписокСообщений - См. СписокСообщений
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока
Функция ПредставлениеЧата(СписокСообщений) Экспорт
	
	ТекстыСообщений = Новый Массив; // Массив Из Строка
	ФорматДаты = "ДФ='dd.MM.yyyy HH:mm'";

	Для Каждого СтрокаСообщения Из СписокСообщений Цикл

		Если СтрокаСообщения.Направление = Перечисления.НаправленияЭДО.Исходящий Тогда
			ЦветТекстаНаименования = ЦветаСтиля.ЦветТекстаНаименованияОтправителяСообщенияБЭД;
		Иначе
			ЦветТекстаНаименования = ЦветаСтиля.ЦветТекстаНаименованияПолучателяСообщенияБЭД;
		КонецЕсли;

		ТекстыСообщений.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения.ПредставлениеОтправитель,
			ШрифтыСтиля.ОбычныйШрифтТекстаБЭД, ЦветТекстаНаименования));

		ТекстыСообщений.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(" %1", Формат(СтрокаСообщения.Дата, ФорматДаты)),
			ШрифтыСтиля.ОбычныйШрифтТекстаБЭД, ЦветаСтиля.ЦветТекстаНеважнаяНадписьБЭД));

		ТекстыСообщений.Добавить(Символы.ПС);

		ТекстыСообщений.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения.ТекстСообщения,
			ШрифтыСтиля.ОбычныйШрифтТекстаБЭД));
		
		ТекстыСообщений.Добавить(Символы.ПС);
		ТекстыСообщений.Добавить(Символы.ПС);
		
	КонецЦикла;
	
	Возврат Новый ФорматированнаяСтрока(ТекстыСообщений);
КонецФункции

// Количество непрочитанных сообщений по документам.
// 
// Параметры:
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  * Значение - Число
Функция КоличествоНепрочитанныхСообщенийПоДокументам(ЭлектронныеДокументы) Экспорт

	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекстовыеСообщенияДокументовЭДО.ЭлектронныйДокумент,
		|	КОЛИЧЕСТВО(ТекстовыеСообщенияДокументовЭДО.Сообщение) КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.ТекстовыеСообщенияДокументовЭДО КАК ТекстовыеСообщенияДокументовЭДО
		|ГДЕ
		|	ТекстовыеСообщенияДокументовЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)
		|	И ТекстовыеСообщенияДокументовЭДО.Прочитано = Ложь
		|СГРУППИРОВАТЬ ПО
		|	ТекстовыеСообщенияДокументовЭДО.ЭлектронныйДокумент";
	
	Запрос.УстановитьПараметр("ЭлектронныеДокументы", ЭлектронныеДокументы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.ЭлектронныйДокумент, ВыборкаДетальныеЗаписи.КоличествоСообщений);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура УстановитьПрочтениеСообщенийДокумента(ЭлектронныйДокумент) Экспорт
	
	СписокСообщений = СписокСообщений(ЭлектронныйДокумент);
	Если не ЗначениеЗаполнено(СписокСообщений) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеСообщения Из СписокСообщений Цикл
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(ОписаниеСообщения.Дата);
		Набор.Отбор.ЭлектронныйДокумент.Установить(ОписаниеСообщения.ЭлектронныйДокумент);
		Набор.Отбор.Сообщение.Установить(ОписаниеСообщения.Сообщение);
		Набор.Прочитать();
		
		Для Каждого ЗаписьНабора Из Набор Цикл
			ЗаписьНабора.Прочитано = Истина;
		КонецЦикла;
		
		Набор.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
